给定一个正整数，返回它在 Excel 表中相对应的列名称。

例如，

    1 -> A
    2 -> B
    3 -> C
    ...
    26 -> Z
    27 -> AA
    28 -> AB 
    ...
示例 1:

输入: 1
输出: "A"
示例 2:

输入: 28
输出: "AB"
示例 3:

输入: 701
输出: "ZY"

=============================================================

class Solution:
    def convertToTitle(self, n: int) -> str:
        r = ""
        while n:
            ys = n % 26
            n = n // 26
            if not ys:   ======================
                n -= 1   =====================
                r = 'Z' + r
            else:
                r = chr(ys - 1 + ord('A')) + r  ============================
        return r
        
